<details><summary style="display:list-item; font-size:16px; color:blue;">Jupyter Help</summary>
    
Having trouble testing your work? Double-check that you have followed the steps below to write, run, save, and test your code!
    
[Click here for a walkthrough GIF of the steps below](https://static-assets.codecademy.com/Courses/ds-python/jupyter-help.gif)

Run all initial cells to import libraries and datasets. Then follow these steps for each question:
    
1. Add your solution to the cell with `## YOUR SOLUTION HERE ## `.
2. Run the cell by selecting the `Run` button or the `Shift`+`Enter` keys.
3. Save your work by selecting the `Save` button, the `command`+`s` keys (Mac), or `control`+`s` keys (Windows).
4. Select the `Test Work` button at the bottom left to test your work.

![Screenshot of the buttons at the top of a Jupyter Notebook. The Run and Save buttons are highlighted](https://static-assets.codecademy.com/Paths/ds-python/jupyter-buttons.png)

Setup

In [1]:
import pandas as pd

# read in datasets
filenames = ['amusementpark_' + str(i) + '.csv' for i in range(6)]
dfs = [pd.read_csv(filename) for filename in filenames]
dfs[0].head()

  Ride_ID                     Ride_Name      Ride_Type Location  Total_Riders
0    A000                  Cheetah Rush  ROLLERCOASTER   AFRICA       1302035
1    A001  Rusizi River Delta Hippo Run     WATER RIDE   AFRICA       1500390
2    A002        Grazing Wildebeest Run  ROLLERCOASTER   AFRICA       1467583
3    A003              Lazy Lion Safari      FLAT RIDE   AFRICA        702522
4    A004                  Ostrich Race  ROLLERCOASTER   AFRICA       1249306

1. Run the `Setup` cell to import libraries and datasets.

In the `Setup` cell, we've created a list of DataFrames named `dfs`. Concatenate this list vertically. Assign the result to the variable `full_df`.

Make sure to run your solution and then save the notebook before selecting `Test Work`!

In [2]:
## YOUR SOLUTION HERE ##
full_df = pd.concat(dfs)

# show output
full_df.head()

,Ride_ID,Ride_Name,Ride_Type,Location,Total_Riders,Location_EUROPE
0,A000,Cheetah Rush,ROLLERCOASTER,AFRICA,1302035,NaN
1,A001,Rusizi River Delta Hippo Run,WATER RIDE,AFRICA,1500390,NaN
2,A002,Grazing Wildebeest Run,ROLLERCOASTER,AFRICA,1467583,NaN
3,A003,Lazy Lion Safari,FLAT RIDE,AFRICA,702522,NaN
4,A004,Ostrich Race,ROLLERCOASTER,AFRICA,1249306,NaN

2. Investigate the output of the prior checkpoint. It looks like `concat` has introduced some `NaN`s because one of the files has a different name for the `Location` column. Write a for loop that will print out `df.columns` (a list of DataFrame columns) for each DataFrame in the list `dfs`.

Make sure to run your solution and then save the notebook before selecting `Test Work`!

In [5]:
## YOUR SOLUTION HERE ##
for dataframe in dfs:
    print(dataframe.columns)

Index(['Ride_ID', 'Ride_Name', 'Ride_Type', 'Location', 'Total_Riders'], dtype='object')
Index(['Ride_ID', 'Ride_Name', 'Ride_Type', 'Location', 'Total_Riders'], dtype='object')
Index(['Ride_ID', 'Ride_Name', 'Ride_Type', 'Location', 'Total_Riders'], dtype='object')
Index(['Ride_ID', 'Ride_Name', 'Ride_Type', 'Location_EUROPE', 'Total_Riders'], dtype='object')
Index(['Ride_ID', 'Ride_Name', 'Ride_Type', 'Location', 'Total_Riders'], dtype='object')
Index(['Ride_ID', 'Ride_Name', 'Ride_Type', 'Location', 'Total_Riders'], dtype='object')

3. Now that we know which `df` has the incorrect column title, rename that column to `Location` and re-concatenate `full_df`.

Make sure to run your solution and then save the notebook before selecting `Test Work`!

In [7]:
## YOUR SOLUTION HERE ##

# rename Location_EUROPE
dfs[3] = dfs[3].rename(columns = {'Location_EUROPE' : 'Location'})

# re-do the concatenation to generate full_df
full_df = pd.concat(dfs)

#show output
full_df.head()

  Ride_ID                     Ride_Name      Ride_Type Location  Total_Riders
0    A000                  Cheetah Rush  ROLLERCOASTER   AFRICA       1302035
1    A001  Rusizi River Delta Hippo Run     WATER RIDE   AFRICA       1500390
2    A002        Grazing Wildebeest Run  ROLLERCOASTER   AFRICA       1467583
3    A003              Lazy Lion Safari      FLAT RIDE   AFRICA        702522
4    A004                  Ostrich Race  ROLLERCOASTER   AFRICA       1249306

4. Now that we have pulled all our different data files together, we can finally do some analytics! Group by `Location` and calculate the average number of `Total_Riders`. Assign the result to the variable `park_compare`. Which park is the most popular park for the company?

Make sure to run your solution and then save the notebook before selecting `Test Work`!

In [9]:
park_compare = full_df.groupby('Location').agg({'Total_Riders' : 'mean'})

# show output
park_compare

               Total_Riders
Location
AFRICA         1.043186e+06
ASIA           8.819763e+06
AUSTRALIA      1.014468e+06
EUROPE         3.931788e+06
NORTH AMERICA  7.088816e+06
SOUTH AMERICA  8.751596e+05